In [1]:
import numpy as np
import pandas as pd

data1 = {'BoolCol':[1, 2, 3, 3, 4], 'attr':[22, 33, 22, 44, 66], 'BoolC': [1, 2, 3, 3, 4],
        'att': [22, 33, 22, 44, 66], 'Bool': [1, 2, 3, 3, 4] }
data2 = {'BoolCol':[1, 2, 7, 7, 8], 'attri': [11, 22, 33, 44, 55], 'BoolC0': [5, 6, 7, 7, 8],
        'att1': [11, 22, 33, 44, 55], 'Bool1': [5, 6, 7, 7, 8] }
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2,index=[10,20,30,40,50])
df1

   BoolCol  attr  BoolC  att  Bool
0        1    22      1   22     1
1        2    33      2   33     2
2        3    22      3   22     3
3        3    44      3   44     3
4        4    66      4   66     4

In [2]:
df2

    BoolCol  attri  BoolC0  att1  Bool1
10        1     11       5    11      5
20        2     22       6    22      6
30        7     33       7    33      7
40        7     44       7    44      7
50        8     55       8    55      8

In [3]:
df1.head(2)

   BoolCol  attr  BoolC  att  Bool
0        1    22      1   22     1
1        2    33      2   33     2

In [4]:
df1.tail(2)

   BoolCol  attr  BoolC  att  Bool
3        3    44      3   44     3
4        4    66      4   66     4

In [5]:
df1.shape

(5, 5)

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
BoolCol    5 non-null int64
attr       5 non-null int64
BoolC      5 non-null int64
att        5 non-null int64
Bool       5 non-null int64
dtypes: int64(5)
memory usage: 328.0 bytes

In [7]:
df1['BoolCol'].value_counts(dropna = False)

3    2
4    1
2    1
1    1
Name: BoolCol, dtype: int64

In [8]:
df1.apply(pd.Series.value_counts)

    BoolCol  attr  BoolC  att  Bool
1       1.0   NaN    1.0  NaN   1.0
2       1.0   NaN    1.0  NaN   1.0
3       2.0   NaN    2.0  NaN   2.0
4       1.0   NaN    1.0  NaN   1.0
22      NaN   2.0    NaN  2.0   NaN
33      NaN   1.0    NaN  1.0   NaN
44      NaN   1.0    NaN  1.0   NaN
66      NaN   1.0    NaN  1.0   NaN

In [9]:
df1['attr']

0    22
1    33
2    22
3    44
4    66
Name: attr, dtype: int64

In [10]:
df1[['attr','BoolC']]

   attr  BoolC
0    22      1
1    33      2
2    22      3
3    44      3
4    66      4

In [11]:
df2['attri'].iloc[1]

22

In [12]:
df2['attri'].loc[10]

11

In [13]:
df1.iloc[0,:]

BoolCol     1
attr       22
BoolC       1
att        22
Bool        1
Name: 0, dtype: int64

In [14]:
df1.iloc[0,0]

1

In [15]:
df1.describe()

        BoolCol       attr     BoolC        att      Bool
count  5.000000   5.000000  5.000000   5.000000  5.000000
mean   2.600000  37.400000  2.600000  37.400000  2.600000
std    1.140175  18.406521  1.140175  18.406521  1.140175
min    1.000000  22.000000  1.000000  22.000000  1.000000
25%    2.000000  22.000000  2.000000  22.000000  2.000000
50%    3.000000  33.000000  3.000000  33.000000  3.000000
75%    3.000000  44.000000  3.000000  44.000000  3.000000
max    4.000000  66.000000  4.000000  66.000000  4.000000

In [16]:
df1.mean()

BoolCol     2.6
attr       37.4
BoolC       2.6
att        37.4
Bool        2.6
dtype: float64

In [17]:
df1.corr()

          BoolCol      attr     BoolC       att      Bool
BoolCol  1.000000  0.760007  1.000000  0.760007  1.000000
attr     0.760007  1.000000  0.760007  1.000000  0.760007
BoolC    1.000000  0.760007  1.000000  0.760007  1.000000
att      0.760007  1.000000  0.760007  1.000000  0.760007
Bool     1.000000  0.760007  1.000000  0.760007  1.000000

In [18]:
df1.count()

BoolCol    5
attr       5
BoolC      5
att        5
Bool       5
dtype: int64

In [19]:
df1.max()

BoolCol     4
attr       66
BoolC       4
att        66
Bool        4
dtype: int64

In [20]:
df1.min()

BoolCol     1
attr       22
BoolC       1
att        22
Bool        1
dtype: int64

In [21]:
df1.median()

BoolCol     3.0
attr       33.0
BoolC       3.0
att        33.0
Bool        3.0
dtype: float64

In [22]:
df1.std()

BoolCol     1.140175
attr       18.406521
BoolC       1.140175
att        18.406521
Bool        1.140175
dtype: float64

In [23]:
df1.append(df2)

D:\Anaconda3\lib\site-packages\pandas\core\frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

    Bool  Bool1  BoolC  BoolC0  BoolCol   att  att1  attr  attri
0    1.0    NaN    1.0     NaN        1  22.0   NaN  22.0    NaN
1    2.0    NaN    2.0     NaN        2  33.0   NaN  33.0    NaN
2    3.0    NaN    3.0     NaN        3  22.0   NaN  22.0    NaN
3    3.0    NaN    3.0     NaN        3  44.0   NaN  44.0    NaN
4    4.0    NaN    4.0     NaN        4  66.0   NaN  66.0    NaN
10   NaN    5.0    NaN     5.0        1   NaN  11.0   NaN   11.0
20   NaN    6.0    NaN     6.0        2   NaN  22.0   NaN   22.0
30   NaN    7.0    NaN     7.0        7   NaN  33.0   NaN   33.0
40   NaN    7.0    NaN     7.0        7   NaN  44.0   NaN   44.0
50   NaN    8.0    NaN     8.0        8   NaN  55.0   NaN   55.0

In [24]:
pd.concat([df1,df2],axis =1)
#axis为0时，合并效果与append一样

    BoolCol  attr  BoolC   att  Bool  BoolCol  attri  BoolC0  att1  Bool1
0       1.0  22.0    1.0  22.0   1.0      NaN    NaN     NaN   NaN    NaN
1       2.0  33.0    2.0  33.0   2.0      NaN    NaN     NaN   NaN    NaN
2       3.0  22.0    3.0  22.0   3.0      NaN    NaN     NaN   NaN    NaN
3       3.0  44.0    3.0  44.0   3.0      NaN    NaN     NaN   NaN    NaN
4       4.0  66.0    4.0  66.0   4.0      NaN    NaN     NaN   NaN    NaN
10      NaN   NaN    NaN   NaN   NaN      1.0   11.0     5.0  11.0    5.0
20      NaN   NaN    NaN   NaN   NaN      2.0   22.0     6.0  22.0    6.0
30      NaN   NaN    NaN   NaN   NaN      7.0   33.0     7.0  33.0    7.0
40      NaN   NaN    NaN   NaN   NaN      7.0   44.0     7.0  44.0    7.0
50      NaN   NaN    NaN   NaN   NaN      8.0   55.0     8.0  55.0    8.0

In [44]:
df1.join(df2.rename(columns = {'BoolCol':'BoolCols'}),how='outer')

      A     B    C    e  BoolCols  attri  BoolC0  att1  Bool1
0   1.0  22.0  1.0  1.0       NaN    NaN     NaN   NaN    NaN
1   2.0  33.0  2.0  2.0       NaN    NaN     NaN   NaN    NaN
2   3.0  22.0  3.0  3.0       NaN    NaN     NaN   NaN    NaN
3   3.0  44.0  3.0  3.0       NaN    NaN     NaN   NaN    NaN
4   4.0  66.0  4.0  4.0       NaN    NaN     NaN   NaN    NaN
10  NaN   NaN  NaN  NaN       1.0   11.0     5.0  11.0    5.0
20  NaN   NaN  NaN  NaN       2.0   22.0     6.0  22.0    6.0
30  NaN   NaN  NaN  NaN       7.0   33.0     7.0  33.0    7.0
40  NaN   NaN  NaN  NaN       7.0   44.0     7.0  44.0    7.0
50  NaN   NaN  NaN  NaN       8.0   55.0     8.0  55.0    8.0

In [26]:
pd.merge(df1,df2,how = 'inner',on='BoolCol', sort = True , suffixes = ('_x','_y'),copy = False)

   BoolCol  attr  BoolC  att  Bool  attri  BoolC0  att1  Bool1
0        1    22      1   22     1     11       5    11      5
1        2    33      2   33     2     22       6    22      6

In [27]:
df1[df1['BoolCol']>3]

   BoolCol  attr  BoolC  att  Bool
4        4    66      4   66     4

In [28]:
df1.sort_values('BoolCol')

   BoolCol  attr  BoolC  att  Bool
0        1    22      1   22     1
1        2    33      2   33     2
2        3    22      3   22     3
3        3    44      3   44     3
4        4    66      4   66     4

In [29]:
df1.sort_values('BoolCol',ascending = False)

   BoolCol  attr  BoolC  att  Bool
4        4    66      4   66     4
2        3    22      3   22     3
3        3    44      3   44     3
1        2    33      2   33     2
0        1    22      1   22     1

In [30]:
df1.sort_values(['BoolCol','attr'],ascending=[True,False])

   BoolCol  attr  BoolC  att  Bool
0        1    22      1   22     1
1        2    33      2   33     2
3        3    44      3   44     3
2        3    22      3   22     3
4        4    66      4   66     4

In [31]:
df1.groupby('attr')

In [32]:
df1.groupby(['BoolCol','BoolC'])

In [33]:
df1.groupby('BoolCol')['BoolC'].mean()

BoolCol
1    1
2    2
3    3
4    4
Name: BoolC, dtype: int64

In [34]:
df1.pivot_table( values = ['attr','Bool'],index = ['BoolCol'], aggfunc = max)

         Bool  attr
BoolCol
1           1    22
2           2    33
3           3    44
4           4    66

In [35]:
df1.groupby('attr').agg(np.mean)

      BoolCol  BoolC  att  Bool
attr
22          2      2   22     2
33          2      2   33     2
44          3      3   44     3
66          4      4   66     4

In [36]:
df1.apply(np.mean)

BoolCol     2.6
attr       37.4
BoolC       2.6
att        37.4
Bool        2.6
dtype: float64

In [37]:
df1.apply(np.max,axis = 1)

0    22
1    33
2    22
3    44
4    66
dtype: int64

In [38]:
df1.columns = ['a','b','c','d','e']
df1

   a   b  c   d  e
0  1  22  1  22  1
1  2  33  2  33  2
2  3  22  3  22  3
3  3  44  3  44  3
4  4  66  4  66  4

In [39]:
df1.rename(columns={'a':'A','b':'B','c':'C'},inplace = True)
df1

   A   B  C   d  e
0  1  22  1  22  1
1  2  33  2  33  2
2  3  22  3  22  3
3  3  44  3  44  3
4  4  66  4  66  4

In [40]:
df1.drop(columns = ['d'],inplace = True)
df1

   A   B  C  e
0  1  22  1  1
1  2  33  2  2
2  3  22  3  3
3  3  44  3  3
4  4  66  4  4

In [41]:
df1.to_csv('./data/df.csv',index = False,encoding = 'utf-8-sig')

In [46]:
nda1 = ([1,2],[3,4])
nda2 = ([5,6],[7,8])
ndarray = np.stack((nda1,nda2),0)
ndarray

array([[[1, 2],
        [3, 4]],

       [[5, 6],
        [7, 8]]])

In [48]:
nda1 = ([1,2],[3,4])
nda2 = ([5,6],[7,8])
ndarray = np.stack((nda1,nda2),1)
ndarray

array([[[1, 2],
        [5, 6]],

       [[3, 4],
        [7, 8]]])